In [1]:
import pandas as pd

In [2]:
d = {
    "name": ["Thom", "Chihiro", "Shugo", "Nilufer"],
    "genre": ["rock", "jazz", "folk", "pop"],
    "num": [10, 20, 30, 40]
}

In [3]:
df = pd.DataFrame(d, index=[4,5,6,7])

In [4]:
df

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [5]:
df[0:2]

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20

In [6]:
df.loc[5:6]

      name genre  num
5  Chihiro  jazz   20
6    Shugo  folk   30

In [7]:
df.iloc[0:4]

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [8]:
df[df["num"] > 15]

      name genre  num
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [9]:
g_list = ["jazz", "folk"]

In [10]:
df[df["genre"].isin(g_list)]

      name genre  num
5  Chihiro  jazz   20
6    Shugo  folk   30

In [11]:
df

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [12]:
d2 = {
    "name": ["Magdalena", "Kaneko", "Bob"],
    "genre": ["synthpop", "jpop", "reggae"],
    "num": [50, 60, 70]
}

In [13]:
df2 = pd.DataFrame(d2, index=[14,15,16])

In [14]:
df2

         name     genre  num
14  Magdalena  synthpop   50
15     Kaneko      jpop   60
16        Bob    reggae   70

In [15]:
pd.concat([df, df2], axis=1)

       name genre   num       name     genre   num
4      Thom  rock  10.0        NaN       NaN   NaN
5   Chihiro  jazz  20.0        NaN       NaN   NaN
6     Shugo  folk  30.0        NaN       NaN   NaN
7   Nilufer   pop  40.0        NaN       NaN   NaN
14      NaN   NaN   NaN  Magdalena  synthpop  50.0
15      NaN   NaN   NaN     Kaneko      jpop  60.0
16      NaN   NaN   NaN        Bob    reggae  70.0

In [16]:
df_final = pd.DataFrame()

In [17]:
df_final = pd.concat([df_final, df])

In [18]:
df_final

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [19]:
df_final = pd.concat([df_final, df2])
df_final

         name     genre  num
4        Thom      rock   10
5     Chihiro      jazz   20
6       Shugo      folk   30
7     Nilufer       pop   40
14  Magdalena  synthpop   50
15     Kaneko      jpop   60
16        Bob    reggae   70

In [20]:
df_final

         name     genre  num
4        Thom      rock   10
5     Chihiro      jazz   20
6       Shugo      folk   30
7     Nilufer       pop   40
14  Magdalena  synthpop   50
15     Kaneko      jpop   60
16        Bob    reggae   70

In [21]:
list_of_names = ["Chihiro", "Shugo", "Kaneko"]

In [22]:
df_final["name"].isin(list_of_names)

4     False
5      True
6      True
7     False
14    False
15     True
16    False
Name: name, dtype: bool

In [23]:
df_final[df_final["name"].isin(list_of_names)]

       name genre  num
5   Chihiro  jazz   20
6     Shugo  folk   30
15   Kaneko  jpop   60